app/controllers/api/v1/services_controller.rb

  def index
    @services = Service.all
---
SELECT "services".* FROM "services"

  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "description", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Corte de Cabelo"], ["description", "Com Tesoura"], ["duration", 1], ["created_at", "2019-10-25 20:22:54.574165"], ["updated_at", "2019-10-25 20:22:54.574165"]]

  def update
    respond_to do |format|
      if @service.update(service_params)
---
UPDATE "services" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "services"."id" = $4  [["name", "Lavagem de cabelo"], ["description", "Com shampoo cheiroso"], ["updated_at", "2019-10-25 21:18:43.619012"], ["id", 33]]

  def destroy
    @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 52]]

    def set_service
      @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]