app/controllers/customers_controller.rb

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 980190962]]
---
  def destroy
    @customer.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_customer
      @customer = Customer.find(params[:id])