app/controllers/customers_controller.rb

INSERT INTO "customers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-07 20:11:23.390552"], ["updated_at", "2019-10-07 20:11:23.390552"]]
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save